package lesson1;

public class Main {

  // 1 Создать пустой проект и прописать метод main();
  public static void main(String[] args) {
    // 2. Создать переменные всех пройденных типов и инициализировать их значения
    // приметивные типы данных

    // Числовые
    byte bytes = 127; // целочисленное занимает 8 бит от -128 до 127
    short shorts = 32767; // целочисленное занимает 16 бит от -32768 до 32767
    int integer = 2147483647; // целочисленное занимает 32 бита от -2147483648 до 2147483647
    long longs = 922372036854775807L; // целочисленное занимает 64 бита от -922372036854775808 до 922372036854775807
    float floats = 3.4e+038F; // с плавующей точкой 32 бита значение от 3.4е-038 до 3,4е+038
    double doubles = 1.7e+308; // с плавующей точкой 64 бита значение от 1.7e-308 до 1.7e+308
    char cr = 'd'; // хранит один символ или цифру занимает 16 бит в кодировке Unicode
    // логические
    boolean booleans = true; // хранит 0 или 1 или true (правда) false (ложь)

    // ссылочные типы данных
    String string = "Создается ссылка на объект класса Стринг в которую заносится текст";
    Integer integer1 = Integer.MAX_VALUE; // Имеет тоже свойство что и примитив только ссылочного типа
    Byte byte1 = Byte.MAX_VALUE; // Имеет тоже свойство что и примитив только ссылочного типа
    Short short1 = Short.MAX_VALUE; // Имеет тоже свойство что и примитив только ссылочного типа







  }

}
